Table of Contents
 Interface IIdeaMaterialByName
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
A material to import by name, any name is allowed. The correct material is resolved by the user in CCM/Checkbot. Name must not be null.
public interface IIdeaMaterialByName : IIdeaMaterial, IIdeaObject
Inherited Members
 IIdeaObject.Id
 IIdeaObject.Name
Properties
 MaterialType
Material type
MaterialType MaterialType { get; }
Property Value
MaterialType
 Edit this page